
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Knative 概述 · Knative 入门中文版</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="本章是全书的第一章，主要用来介绍 Knative。">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="ServiceMesher">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search-plus/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-prism/prism-ghcolors.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="serving.html" />
    
    
    <link rel="prev" href="preface.html" />
    

    
        <link rel="shortcut icon" href='favicon.ico' type="image/x-icon">
    
    
        <link rel="bookmark" href='favicon.ico' type="image/x-icon">
    
    
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"repo":"servicemesher/getting-started-with-knative","types":["star"],"size":"small"};
    </script>

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="http://www.servicemesher.com" target="_blank" class="custom-link">ServiceMesher主页</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                        <b>1.1.</b>
                    
                    译者序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="preface.html">
            
                <a href="preface.html">
            
                    
                        <b>1.2.</b>
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3" data-path="knative-overview.html">
            
                <a href="knative-overview.html">
            
                    
                        <b>1.3.</b>
                    
                    Knative 概述
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="serving.html">
            
                <a href="serving.html">
            
                    
                        <b>1.4.</b>
                    
                    Serving（服务）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="build.html">
            
                <a href="build.html">
            
                    
                        <b>1.5.</b>
                    
                    Build（构建）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="eventing.html">
            
                <a href="eventing.html">
            
                    
                        <b>1.6.</b>
                    
                    Eventing（事件）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="installing-knative.html">
            
                <a href="installing-knative.html">
            
                    
                        <b>1.7.</b>
                    
                    Knative 安装
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="using-knative.html">
            
                <a href="using-knative.html">
            
                    
                        <b>1.8.</b>
                    
                    Knative 使用
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="putting-it-all-together.html">
            
                <a href="putting-it-all-together.html">
            
                    
                        <b>1.9.</b>
                    
                    演练
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="what-is-next.html">
            
                <a href="what-is-next.html">
            
                    
                        <b>1.10.</b>
                    
                    下一步
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >Knative 概述</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div class="search-plus" id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="knative-&#x6982;&#x8FF0;">Knative &#x6982;&#x8FF0;</h1>
<p>&#x6211;&#x4EEC;&#x6709;&#x4E00;&#x4E2A;&#x4FE1;&#x5FF5;&#xFF1A;&#x4EE5;&#x5E73;&#x53F0;&#x7684;&#x65B9;&#x5F0F;&#x63D0;&#x4F9B;&#x8F6F;&#x4EF6;&#x662F;&#x4E00;&#x4E2A;&#x6700;&#x4F73;&#x9009;&#x62E9;&#x3002;&#x4E8B;&#x5B9E;&#x8BC1;&#x660E;&#xFF0C;&#x6807;&#x51C6;&#x5316;&#x7684;&#x5F00;&#x53D1;&#x548C;&#x90E8;&#x7F72;&#x6D41;&#x7A0B;&#x80FD;&#x8BA9;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x66F4;&#x4E13;&#x6CE8;&#x4E8E;&#x65B0;&#x529F;&#x80FD;&#x7684;&#x7814;&#x53D1;&#xFF0C;&#x4ECE;&#x800C;&#x51CF;&#x5C11;&#x65F6;&#x95F4;&#x548C;&#x91D1;&#x94B1;&#x4E0A;&#x7684;&#x6D88;&#x8017;&#x3002;&#x4E0D;&#x4EC5;&#x5982;&#x6B64;&#xFF0C;&#x786E;&#x4FDD;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E4B;&#x95F4;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x4E5F;&#x610F;&#x5473;&#x7740;&#x5176;&#x66F4;&#x5BB9;&#x6613;&#x6253;&#x8865;&#x4E01;&#x3001;&#x66F4;&#x65B0;&#x548C;&#x76D1;&#x63A7;&#xFF0C;&#x4ECE;&#x800C;&#x8BA9;&#x8FD0;&#x7EF4;&#x5DE5;&#x4F5C;&#x4E5F;&#x66F4;&#x52A0;&#x9AD8;&#x6548;&#x3002;Knative &#x7684;&#x76EE;&#x6807;&#x5C31;&#x662F;&#x6210;&#x4E3A;&#x8FD9;&#x6837;&#x7684;&#x73B0;&#x4EE3;&#x5316;&#x5E73;&#x53F0;&#x3002;</p>
<h2 id="knative-&#x662F;&#x4EC0;&#x4E48;&#xFF1F;">Knative &#x662F;&#x4EC0;&#x4E48;&#xFF1F;</h2>
<p>&#x6211;&#x4EEC;&#x5148;&#x6765;&#x770B;&#x770B; Knative &#x7684;&#x76EE;&#x6807;&#x3002;Knative &#x7684;&#x76EE;&#x6807;&#x662F;&#x5728;&#x57FA;&#x4E8E; Kubernetes &#x4E4B;&#x4E0A;&#x4E3A;&#x6574;&#x4E2A;&#x5F00;&#x53D1;&#x751F;&#x547D;&#x5468;&#x671F;&#x63D0;&#x4F9B;&#x5E2E;&#x52A9;&#x3002;&#x5B83;&#x7684;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x662F;&#xFF1A;&#x9996;&#x5148;&#x4F7F;&#x4F60;&#x4F5C;&#x4E3A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x80FD;&#x591F;&#x4EE5;&#x4F60;&#x60F3;&#x8981;&#x7684;&#x8BED;&#x8A00;&#x548C;&#x4EE5;&#x4F60;&#x60F3;&#x8981;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#xFF0C;&#x5176;&#x6B21;&#x5E2E;&#x52A9;&#x4F60;&#x6784;&#x5EFA;&#x548C;&#x6253;&#x5305;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x6700;&#x540E;&#x5E2E;&#x52A9;&#x4F60;&#x8FD0;&#x884C;&#x548C;&#x4F38;&#x7F29;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>&#x4E3A;&#x6B64;&#xFF0C;Knative &#x5C06;&#x91CD;&#x70B9;&#x653E;&#x5728;&#x4E09;&#x4E2A;&#x5173;&#x952E;&#x7EC4;&#x4EF6;&#x4E0A;&#xFF1A;<em>build&#xFF08;&#x6784;&#x5EFA;&#xFF09;</em>&#x4F60;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x4E3A;&#x5176;&#x63D0;&#x4F9B;&#x6D41;&#x91CF;<em>serving&#xFF08;&#x670D;&#x52A1;&#xFF09;</em>&#xFF0C;&#x4EE5;&#x53CA;&#x786E;&#x4FDD;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x80FD;&#x591F;&#x8F7B;&#x677E;&#x5730;&#x751F;&#x4EA7;&#x548C;&#x6D88;&#x8D39;<em>event&#xFF08;&#x4E8B;&#x4EF6;&#xFF09;</em>&#x3002;</p>
<p><em>Build&#xFF08;&#x6784;&#x5EFA;&#xFF09;</em></p>
<blockquote>
<p>&#x901A;&#x8FC7;&#x7075;&#x6D3B;&#x7684;&#x63D2;&#x4EF6;&#x5316;&#x7684;&#x6784;&#x5EFA;&#x7CFB;&#x7EDF;&#x5C06;&#x7528;&#x6237;&#x6E90;&#x4EE3;&#x7801;&#x6784;&#x5EFA;&#x6210;&#x5BB9;&#x5668;&#x3002;&#x76EE;&#x524D;&#x5DF2;&#x7ECF;&#x652F;&#x6301;&#x591A;&#x4E2A;&#x6784;&#x5EFA;&#x7CFB;&#x7EDF;&#xFF0C;&#x6BD4;&#x5982; Google &#x7684; Kaniko&#xFF0C;&#x5B83;&#x65E0;&#x9700;&#x8FD0;&#x884C; Docker daemon &#x5C31;&#x53EF;&#x4EE5;&#x5728; Kubernetes &#x96C6;&#x7FA4;&#x4E0A;&#x6784;&#x5EFA;&#x5BB9;&#x5668;&#x955C;&#x50CF;&#x3002;</p>
</blockquote>
<p><em>Serving&#xFF08;&#x670D;&#x52A1;&#xFF09;</em></p>
<blockquote>
<p>&#x57FA;&#x4E8E;&#x8D1F;&#x8F7D;&#x81EA;&#x52A8;&#x4F38;&#x7F29;&#xFF0C;&#x5305;&#x62EC;&#x5728;&#x6CA1;&#x6709;&#x8D1F;&#x8F7D;&#x65F6;&#x7F29;&#x51CF;&#x5230;&#x96F6;&#x3002;&#x5141;&#x8BB8;&#x4F60;&#x4E3A;&#x591A;&#x4E2A;&#x4FEE;&#x8BA2;&#x7248;&#x672C;&#xFF08;revision&#xFF09;&#x5E94;&#x7528;&#x521B;&#x5EFA;&#x6D41;&#x91CF;&#x7B56;&#x7565;&#xFF0C;&#x4ECE;&#x800C;&#x80FD;&#x591F;&#x901A;&#x8FC7; URL &#x8F7B;&#x677E;&#x8DEF;&#x7531;&#x5230;&#x76EE;&#x6807;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;</p>
</blockquote>
<p><em>Event&#xFF08;&#x4E8B;&#x4EF6;&#xFF09;</em></p>
<blockquote>
<p>&#x4F7F;&#x5F97;&#x751F;&#x4EA7;&#x548C;&#x6D88;&#x8D39;&#x4E8B;&#x4EF6;&#x53D8;&#x5F97;&#x5BB9;&#x6613;&#x3002;&#x62BD;&#x8C61;&#x51FA;&#x4E8B;&#x4EF6;&#x6E90;&#xFF0C;&#x5E76;&#x5141;&#x8BB8;&#x64CD;&#x4F5C;&#x4EBA;&#x5458;&#x4F7F;&#x7528;&#x81EA;&#x5DF1;&#x9009;&#x62E9;&#x7684;&#x6D88;&#x606F;&#x4F20;&#x9012;&#x5C42;&#x3002;</p>
</blockquote>
<p>Knative &#x662F;&#x4EE5; Kubernetes &#x7684;&#x4E00;&#x7EC4;&#x81EA;&#x5B9A;&#x4E49;&#x8D44;&#x6E90;&#x7C7B;&#x578B;&#xFF08;CRD&#xFF09;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x5B89;&#x88C5;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x53EA;&#x9700;&#x4F7F;&#x7528;&#x51E0;&#x4E2A; YAML &#x6587;&#x4EF6;&#x5C31;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x5730;&#x5F00;&#x59CB;&#x4F7F;&#x7528; Knative &#x4E86;&#x3002;&#x8FD9;&#x4E5F;&#x610F;&#x5473;&#x7740;&#xFF0C;&#x5728;&#x672C;&#x5730;&#x6216;&#x8005;&#x6258;&#x7BA1;&#x4E91;&#x670D;&#x52A1;&#x4E0A;&#xFF0C;&#x4EFB;&#x4F55;&#x53EF;&#x4EE5;&#x8FD0;&#x884C; Kubernetes &#x7684;&#x5730;&#x65B9;&#x90FD;&#x53EF;&#x4EE5;&#x8FD0;&#x884C; Knative &#x548C;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x3002;</p>
<table>
<thead>
<tr>
<th style="text-align:left">Kubernetes &#x77E5;&#x8BC6;</th>
</tr>
</thead>
<tbody>
<tr>
<td style="text-align:left">&#x7531;&#x4E8E; Knative &#x662F;&#x57FA;&#x4E8E; Kubernetes &#x7684;&#x4E00;&#x7CFB;&#x5217;&#x6269;&#x5C55;&#xFF0C;&#x56E0;&#x6B64;&#x5EFA;&#x8BAE;&#x4F60;&#x5148;&#x4E86;&#x89E3;&#x4E0B; Kubernetes &#x548C; Docker &#x7684;&#x67B6;&#x6784;&#x548C;&#x672F;&#x8BED;&#x3002;&#x4ECA;&#x540E;&#x6211;&#x4EEC;&#x4F1A;&#x63D0;&#x53CA;&#x4EE5;&#x4E0B;&#x672F;&#x8BED;&#xFF0C;&#x6BD4;&#x5982; namespace&#x3001;Deployment&#x3001;ReplicaSet &#x548C; Pod&#x3002;&#x719F;&#x6089;&#x8FD9;&#x4E9B; Kubernetes &#x672F;&#x8BED;&#x5C06;&#x5E2E;&#x52A9;&#x4F60;&#x5728;&#x9605;&#x8BFB;&#x65F6;&#x66F4;&#x597D;&#x5730;&#x7406;&#x89E3; Knative &#x7684;&#x57FA;&#x672C;&#x5DE5;&#x4F5C;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5BF9;&#x8FD9;&#x4E9B;&#x90FD;&#x4E0D;&#x719F;&#x6089;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E24;&#x4E2A;&#x94FE;&#x63A5;&#xFF1A;<a href="https://kubernetes.io/docs/tutorials/kubernetes-basics/" target="_blank">Kubernetes</a> &#x548C; <a href="https://kubernetes.io/docs/reference/generated/kubernetes-api/v1.12/#objectreference-v1-core" target="_blank">Docker</a> &#x4E0A;&#x90FD;&#x6709;&#x5F88;&#x68D2;&#x7684;&#x57F9;&#x8BAD;&#x6750;&#x6599;&#xFF0C;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x4E0A;&#x9605;&#x8BFB;&#x3002;</td>
</tr>
</tbody>
</table>
<h2 id="&#x65E0;&#x670D;&#x52A1;&#x5668;&#x67B6;&#x6784;&#xFF08;serverless&#xFF09;&#xFF1F;">&#x65E0;&#x670D;&#x52A1;&#x5668;&#x67B6;&#x6784;&#xFF08;serverless&#xFF09;&#xFF1F;</h2>
<p>&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x8BA8;&#x8BBA;&#x4E86;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5BB9;&#x5668;&#x5316;&#x3002;&#x4F46;&#x90FD;2019&#x5E74;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x8BFB;&#x4E86;&#x534A;&#x7AE0;&#x5374;&#x8FD8;&#x6CA1;&#x6709;&#x63D0;&#x5230;&#x201C;&#x65E0;&#x670D;&#x52A1;&#x5668;&#x67B6;&#x6784;&#xFF08;serverless&#xFF09;&#x201D;&#x8FD9;&#x4E2A;&#x8BCD;&#x3002;&#x4E5F;&#x8BB8;&#x4F5C;&#x4E3A;&#x5F53;&#x4ECA;&#x6280;&#x672F;&#x4E2D;&#x88AB;&#x63D0;&#x5230;&#x6700;&#x591A;&#x7684;&#x4E00;&#x4E2A;&#x8BCD;&#xFF0C;&#x65E0;&#x670D;&#x52A1;&#x5668;&#x67B6;&#x6784;&#xFF08;serverless&#xFF09;&#x4ECD;&#x7136;&#x5728;&#x5BFB;&#x627E;&#x4E00;&#x4E2A;&#x6574;&#x4E2A;&#x884C;&#x4E1A;&#x90FD;&#x80FD;&#x8BA4;&#x540C;&#x7684;&#x5B9A;&#x4E49;&#x3002;&#x8BB8;&#x591A;&#x4EBA;&#x90FD;&#x540C;&#x610F;&#x8FD9;&#x4E2A;&#x7406;&#x5FF5;&#x7684;&#x5F71;&#x54CD;&#x6700;&#x5927;&#x7684;&#x662F;&#x4EE3;&#x7801;&#x91CF;&#xFF0C;&#x6BD4;&#x5982;&#x4EE5;&#x524D;&#x9700;&#x8981;&#x7F16;&#x5199;&#x5927;&#x578B;&#x3001;&#x5355;&#x4E00;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x73B0;&#x5728;&#x4F60;&#x53EA;&#x9700;&#x7F16;&#x5199;&#x901A;&#x8FC7;<em>&#x4E8B;&#x4EF6;</em>&#x6765;&#x8C03;&#x7528;&#x7684;&#x5C0F;&#x578B;&#x3001;&#x5355;&#x4E00;&#x7528;&#x9014;&#x7684;<em>&#x51FD;&#x6570;</em>&#x5373;&#x53EF;&#x3002;&#x8FD9;&#x4E9B;<em>&#x4E8B;&#x4EF6;</em>&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x5230;&#x662F;&#x4E00;&#x4E2A; HTTP &#x8BF7;&#x6C42;&#x6216;&#x4E00;&#x4E2A;&#x6765;&#x81EA;&#x6D88;&#x606F;&#x901A;&#x9053;&#xFF08;&#x5982; Apache Kafka&#xFF09;&#x7684;&#x6D88;&#x606F;&#x3002;&#x540C;&#x65F6;<em>&#x4E8B;&#x4EF6;</em>&#x4E5F;&#x53EF;&#x80FD;&#x662F;&#x95F4;&#x63A5;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x8FD9;&#x4E9B;&#x64CD;&#x4F5C;&#xFF1A;&#x5C06;&#x56FE;&#x50CF;&#x4E0A;&#x4F20;&#x5230; Google Cloud Storage &#x6216;&#x66F4;&#x65B0;&#x4E86; Amazon &#x7684; DynamoDB &#x4E2D;&#x7684;&#x4E00;&#x5F20;&#x8868;&#x3002;</p>
<p>&#x8BB8;&#x591A;&#x4EBA;&#x4E5F;&#x90FD;&#x540C;&#x610F;&#x8FD9;&#x8868;&#x793A;&#x7740;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x53EA;&#x5728;&#x5904;&#x7406;&#x8BF7;&#x6C42;&#x65F6;&#x624D;&#x7528;&#x5230;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;&#x3002;&#x5BF9;&#x4E8E;&#x5F88;&#x591A;&#x6258;&#x7BA1;&#x670D;&#x52A1;&#x6765;&#x8BF4;&#xFF0C;&#x5982; Amazon &#x7684; Lambda &#x6216; Google Cloud Functions&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x4E3A;&#x6D3B;&#x8DC3;&#x671F;&#x95F4;&#x7684;&#x8BA1;&#x7B97;&#x670D;&#x52A1;&#x4ED8;&#x8D39;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4E00;&#x53F0;7x24&#x5C0F;&#x65F6;&#x8FD0;&#x884C;&#x5E76;&#x53EF;&#x80FD;&#x5728;&#x5927;&#x90E8;&#x5206;&#x65F6;&#x95F4;&#x5185;&#x65E0;&#x6240;&#x4E8B;&#x4E8B;&#x7684;&#x865A;&#x62DF;&#x673A;&#x3002;&#x5728;&#x672C;&#x5730;&#x6216;&#x975E;&#x6258;&#x7BA1;&#x7684;&#x65E0;&#x670D;&#x52A1;&#x5668;&#x67B6;&#x6784;&#xFF08;serverless&#xFF09;&#x5E73;&#x53F0;&#x4E0A;&#xFF0C;&#x5219;&#x8868;&#x793A;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x53EA;&#x5728;&#x9700;&#x8981;&#x65F6;&#x8FD0;&#x884C;&#xFF0C;&#x5728;&#x4E0D;&#x9700;&#x8981;&#x65F6;&#x5C31;&#x505C;&#x6B62;&#xFF0C;&#x4ECE;&#x800C;&#x8BA9;&#x4F60;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x80FD;&#x5728;&#x5176;&#x4ED6;&#x65B9;&#x9762;&#x81EA;&#x7531;&#x4F7F;&#x7528;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x4E9B;&#x57FA;&#x7840;&#x539F;&#x7406;&#x4E4B;&#x4E0A;&#x7684;&#x662F;&#x4E00;&#x573A;&#x5723;&#x6218;&#x3002;&#x6709;&#x4E9B;&#x4EBA;&#x575A;&#x6301;&#x65E0;&#x670D;&#x52A1;&#x5668;&#x67B6;&#x6784;&#xFF08;serverless&#xFF09;&#x53EA;&#x9002;&#x5408;&#x5728;&#x6258;&#x7BA1;&#x7684;&#x4E91;&#x73AF;&#x5883;&#x4E2D;&#x8FD0;&#x884C;&#xFF0C;&#x5728;&#x672C;&#x5730;&#x8FD0;&#x884C;&#x8FD9;&#x6837;&#x7684;&#x5E73;&#x53F0;&#x5B8C;&#x5168;&#x662F;&#x4E0D;&#x5BF9;&#x7684;&#x3002;&#x5176;&#x4ED6;&#x4EBA;&#x5219;&#x8BA4;&#x4E3A;&#x5B83;&#x66F4;&#x50CF;&#x662F;&#x4E00;&#x79CD;&#x54F2;&#x5B66;&#x7406;&#x8BBA;&#x4E0A;&#x7684;&#x8BBE;&#x8BA1;&#x3002;&#x4E5F;&#x8BB8;&#x8FD9;&#x4E9B;&#x5B9A;&#x4E49;&#x6700;&#x540E;&#x4F1A;&#x5408;&#x5E76;&#xFF0C;&#x4E5F;&#x8BB8;&#x4E0D;&#x4F1A;&#x3002;&#x5C31;&#x76EE;&#x524D;&#x6765;&#x8BF4;&#xFF0C;&#x968F;&#x7740;&#x65E0;&#x670D;&#x52A1;&#x5668;&#x67B6;&#x6784;&#xFF08;serverless&#xFF09;&#x666E;&#x53CA;&#x7387;&#x7684;&#x6301;&#x7EED;&#x589E;&#x957F;&#xFF0C;Knative &#x6700;&#x6709;&#x53EF;&#x80FD;&#x6210;&#x4E3A;&#x5176;&#x6807;&#x51C6;&#x3002;</p>
<h2 id="&#x4E3A;&#x4EC0;&#x4E48;&#x662F;-knative-&#xFF1F;">&#x4E3A;&#x4EC0;&#x4E48;&#x662F; Knative &#xFF1F;</h2>
<p>&#x9664;&#x4E86;&#x5173;&#x4E8E;&#x65E0;&#x670D;&#x52A1;&#x5668;&#x67B6;&#x6784;&#xFF08;serverless&#xFF09;&#x5B9A;&#x4E49;&#x7684;&#x4E89;&#x8BBA;&#x4E4B;&#x5916;&#xFF0C;&#x4E0B;&#x4E00;&#x4E2A;&#x903B;&#x8F91;&#x95EE;&#x9898;&#x662F;&#x201C;&#x4E3A;&#x4EC0;&#x4E48;&#x521B;&#x9020;&#x7684;&#x662F; Knative &#xFF1F;&#x201D;&#x968F;&#x7740;&#x57FA;&#x4E8E;&#x5BB9;&#x5668;&#x7684;&#x67B6;&#x6784;&#x7684;&#x6D41;&#x884C;&#x548C; Kubernetes &#x7684;&#x666E;&#x53CA;&#xFF0C;&#x6211;&#x4EEC;&#x53C8;&#x5F00;&#x59CB;&#x89C1;&#x5230;&#x4E00;&#x4E9B;&#x76F8;&#x540C;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x4E4B;&#x524D;&#x4E5F;&#x51FA;&#x73B0;&#x5728;&#x5E73;&#x53F0;&#x5373;&#x670D;&#x52A1;&#xFF08;PaaS&#xFF09;&#x65B9;&#x6848;&#x4E0A;&#x5E76;&#x63A8;&#x52A8;&#x4E86;&#x5176;&#x53D1;&#x5C55;&#x3002;&#x5982;&#x5728;&#x6784;&#x5EFA;&#x5BB9;&#x5668;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x8BE5;&#x5982;&#x4F55;&#x4FDD;&#x8BC1;&#x5176;&#x4E00;&#x81F4;&#x6027;&#xFF1F;&#x8C01;&#x8D1F;&#x8D23;&#x7ED9;&#x6240;&#x6709;&#x4E1C;&#x897F;&#x6253;&#x8865;&#x4E01;&#xFF1F;&#x5982;&#x4F55;&#x6839;&#x636E;&#x9700;&#x6C42;&#x6765;&#x4F38;&#x7F29;&#xFF1F;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x96F6;&#x505C;&#x673A;&#x90E8;&#x7F72;&#xFF1F;</p>
<p>&#x867D;&#x7136; Kubernetes &#x786E;&#x5B9E;&#x5DF2;&#x7ECF;&#x6F14;&#x8FDB;&#x5E76;&#x5F00;&#x59CB;&#x89E3;&#x51B3;&#x5176;&#x4E2D;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x4E4B;&#x524D;&#x63D0;&#x5230;&#x7684;&#x5173;&#x4E8E;&#x4E0D;&#x65AD;&#x53D1;&#x5C55;&#x7684;&#x65E0;&#x670D;&#x52A1;&#x5668;&#x67B6;&#x6784;&#xFF08;serverless&#xFF09;&#x7684;&#x6982;&#x5FF5;&#x65B9;&#x9762;&#x4EA7;&#x751F;&#x4E86;&#x66F4;&#x591A;&#x7684;&#x95EE;&#x9898;&#x3002;&#x5982;&#x4F55;&#x7BA1;&#x7406;&#x591A;&#x4E2A;&#x4E8B;&#x4EF6;&#x7C7B;&#x578B;&#x7684;&#x4E00;&#x81F4;&#x6027;&#xFF1F;&#x5982;&#x4F55;&#x5B9A;&#x4E49;&#x4E8B;&#x4EF6;&#x6E90;&#x548C;&#x76EE;&#x6807;&#xFF1F;</p>
<p>&#x8BB8;&#x591A;&#x65E0;&#x670D;&#x52A1;&#x5668;&#x67B6;&#x6784;&#xFF08;serverless&#xFF09;&#x6216;&#x51FD;&#x6570;&#x5373;&#x670D;&#x52A1;&#xFF08;FaaS&#xFF09;&#x6846;&#x67B6;&#x90FD;&#x5C1D;&#x8BD5;&#x56DE;&#x7B54;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x90FD;&#x5728;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF0C;&#x4E14;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x90FD;&#x7528;&#x5230;&#x4E86; Kubernetes&#x3002;&#x800C; Knative &#x6784;&#x5EFA;&#x5728; Kubernetes &#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x5E76;&#x4E3A;&#x6784;&#x5EFA;&#x548C;&#x90E8;&#x7F72;&#x65E0;&#x670D;&#x52A1;&#x5668;&#x67B6;&#x6784;&#xFF08;serverless&#xFF09;&#x548C;&#x57FA;&#x4E8E;&#x4E8B;&#x4EF6;&#x9A71;&#x52A8;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x81F4;&#x7684;&#x6807;&#x51C6;&#x6A21;&#x5F0F;&#x3002;Knative &#x51CF;&#x5C11;&#x4E86;&#x8FD9;&#x79CD;&#x65B0;&#x7684;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x65B9;&#x6CD5;&#x6240;&#x4EA7;&#x751F;&#x7684;&#x5F00;&#x9500;&#xFF0C;&#x540C;&#x65F6;&#x8FD8;&#x628A;&#x8DEF;&#x7531;&#xFF08;routing&#xFF09;&#x548C;&#x4E8B;&#x4EF6;&#xFF08;eventing&#xFF09;&#x7684;&#x590D;&#x6742;&#x6027;&#x62BD;&#x8C61;&#x51FA;&#x6765;&#x3002;</p>
<h2 id="&#x7ED3;&#x8BBA;">&#x7ED3;&#x8BBA;</h2>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x5F88;&#x597D;&#x5730;&#x7406;&#x89E3;&#x4E86; Knative &#x662F;&#x4EC0;&#x4E48;&#x4EE5;&#x53CA;&#x5B83;&#x88AB;&#x521B;&#x9020;&#x51FA;&#x6765;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4EEC;&#x5C06;&#x8FDB;&#x4E00;&#x6B65;&#x6DF1;&#x5165;&#x4E86;&#x89E3;&#x5B83;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x7AE0;&#x8282;&#x5C06;&#x4ECB;&#x7ECD; Knative &#x7684;&#x4E09;&#x4E2A;&#x5173;&#x952E;&#x7EC4;&#x4EF6;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x8BE6;&#x7EC6;&#x7814;&#x7A76;&#x5B83;&#x4EEC;&#xFF0C;&#x5E76;&#x89E3;&#x91CA;&#x5B83;&#x4EEC;&#x662F;&#x5982;&#x4F55;&#x534F;&#x540C;&#x5DE5;&#x4F5C;&#x7684;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x5145;&#x5206;&#x53D1;&#x6325;&#x5B83;&#x4EEC;&#x7684;&#x6F5C;&#x529B;&#x3002;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4E86;&#x89E3;&#x5982;&#x4F55;&#x5728; Kubernetes &#x96C6;&#x7FA4;&#x4E0A;&#x5B89;&#x88C5; Knative &#x548C;&#x4E00;&#x4E9B;&#x66F4;&#x9AD8;&#x7EA7;&#x7684;&#x7528;&#x4F8B;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x901A;&#x8FC7;&#x6F14;&#x793A;&#x4E00;&#x4E2A; demo &#x6765;&#x5C55;&#x793A;&#x4F60;&#x80FD;&#x5728;&#x8FD9;&#x4E2A;&#x62A5;&#x544A;&#x4E2D;&#x5B66;&#x4E60;&#x5230;&#x7684;&#x5927;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x3002;</p>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; <a href="http://www.servicemesher.com" target="_blank">servicemesher.com</a> 2017-2019 all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification"> &#x6700;&#x540E;&#x66F4;&#x65B0;&#x4E8E; 
2019-05-13 15:19:41
</span></footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="preface.html" class="navigation navigation-prev " aria-label="Previous page: 前言">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="serving.html" class="navigation navigation-next " aria-label="Next page: Serving（服务）">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"owner":["jordanchenCN"],"reviewer":["rootsongjc","haiker2011","icyxp","SataQiu"],"description":"本章是全书的第一章，主要用来介绍 Knative。","publishDate":"2019-03-05T00:00:00.000Z","updateDate":"2019-03-10T00:00:00.000Z","title":"Knative 概述","level":"1.3","depth":1,"next":{"title":"Serving（服务）","level":"1.4","depth":1,"path":"serving.md","ref":"serving.md","articles":[]},"previous":{"title":"前言","level":"1.2","depth":1,"path":"preface.md","ref":"preface.md","articles":[]},"dir":"ltr"},"config":{"plugins":["github","codesnippet","splitter","-lunr","-search","search-plus","-sharing","theme-default","edit-link","page-toc-button","back-to-top-button","github-buttons@2.1.0","-highlight","prism","prism-themes","favicon@^0.0.2","tbfed-pagefooter@^0.0.1","3-ba","sitemap-general","ga"],"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright © <a href=http://www.servicemesher.com>servicemesher.com</a> 2017-2019","modify_label":" 最后更新于 ","modify_format":"YYYY-MM-DD HH:mm:ss"},"prism":{"css":["prism-themes/themes/prism-ghcolors.css"]},"github":{"url":"https://github.com/servicemesher/getting-started-with-knative"},"splitter":{},"codesnippet":{},"sitemap-general":{"prefix":"http://www.servicemesher.com/getting-started-with-knative/"},"fontsettings":{"theme":"white","family":"sans","size":2},"favicon":{"shortcut":"favicon.ico","bookmark":"favicon.ico"},"page-toc-button":{},"back-to-top-button":{},"prism-themes":{},"github-buttons":{"repo":"servicemesher/getting-started-with-knative","types":["star"],"size":"small"},"3-ba":{"configuration":"auto","token":"154337f0d95f0b110f98c1d5d7038895"},"ga":{"configuration":"auto","token":"UA-93485976-2"},"edit-link":{"label":"在线编辑","base":"https://github.com/servicemesher/getting-started-with-knative/edit/master"},"theme-default":{"showLevel":true,"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"}},"search-plus":{}},"theme":"default","author":"ServiceMesher","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Knative 入门中文版","language":"zh-hans","links":{"sidebar":{"ServiceMesher主页":"http://www.servicemesher.com"}},"gitbook":">=3.2.0","description":"Knative 入门中文版 by ServiceMesher 社区"},"file":{"path":"knative-overview.md","mtime":"2019-05-13T07:19:41.177Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-06-30T12:52:56.530Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-plus/jquery.mark.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-plus/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-edit-link/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-3-ba/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

