
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>前言 · Knative 入门中文版</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="本章是全书的前言，用于说明本书的成因、划定目标读者、致谢等。">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="ServiceMesher">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search-plus/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-prism/prism-ghcolors.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="knative-overview.html" />
    
    
    <link rel="prev" href="./" />
    

    
        <link rel="shortcut icon" href='favicon.ico' type="image/x-icon">
    
    
        <link rel="bookmark" href='favicon.ico' type="image/x-icon">
    
    
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"repo":"servicemesher/getting-started-with-knative","types":["star"],"size":"small"};
    </script>

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="http://www.servicemesher.com" target="_blank" class="custom-link">ServiceMesher主页</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                        <b>1.1.</b>
                    
                    译者序
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="preface.html">
            
                <a href="preface.html">
            
                    
                        <b>1.2.</b>
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="knative-overview.html">
            
                <a href="knative-overview.html">
            
                    
                        <b>1.3.</b>
                    
                    Knative 概述
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="serving.html">
            
                <a href="serving.html">
            
                    
                        <b>1.4.</b>
                    
                    Serving（服务）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="build.html">
            
                <a href="build.html">
            
                    
                        <b>1.5.</b>
                    
                    Build（构建）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="eventing.html">
            
                <a href="eventing.html">
            
                    
                        <b>1.6.</b>
                    
                    Eventing（事件）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="installing-knative.html">
            
                <a href="installing-knative.html">
            
                    
                        <b>1.7.</b>
                    
                    Knative 安装
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="using-knative.html">
            
                <a href="using-knative.html">
            
                    
                        <b>1.8.</b>
                    
                    Knative 使用
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="putting-it-all-together.html">
            
                <a href="putting-it-all-together.html">
            
                    
                        <b>1.9.</b>
                    
                    演练
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="what-is-next.html">
            
                <a href="what-is-next.html">
            
                    
                        <b>1.10.</b>
                    
                    下一步
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >前言</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div class="search-plus" id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x524D;&#x8A00;">&#x524D;&#x8A00;</h1>
<p>Kubernetes &#x8D62;&#x4E86;&#x3002;&#x8FD9;&#x4E0D;&#x662F;&#x5938;&#x5927;&#x5176;&#x8BCD;&#xFF0C;&#x4E8B;&#x5B9E;&#x5C31;&#x662F;&#x5982;&#x6B64;&#x3002;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x4EBA;&#x5F00;&#x59CB;&#x57FA;&#x4E8E;&#x5BB9;&#x5668;&#x90E8;&#x7F72;&#xFF0C;&#x800C; Kubernetes &#x5DF2;&#x7ECF;&#x6210;&#x4E3A;&#x5BB9;&#x5668;&#x7F16;&#x6392;&#x7684;&#x4E8B;&#x5B9E;&#x6807;&#x51C6;&#x3002;&#x4F46;&#x662F;&#xFF0C;Kubernetes &#x81EA;&#x5DF1;&#x4E5F;&#x627F;&#x8BA4;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x4E2A;<em>&#x5BB9;&#x5668;</em>&#x5E73;&#x53F0;&#x800C;&#x4E0D;&#x662F;<em>&#x4EE3;&#x7801;</em>&#x5E73;&#x53F0;&#x3002;&#x5B83;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x8FD0;&#x884C;&#x548C;&#x7BA1;&#x7406;&#x5BB9;&#x5668;&#x7684;&#x5F88;&#x597D;&#x7684;&#x5E73;&#x53F0;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E9B;&#x5BB9;&#x5668;&#x662F;&#x5982;&#x4F55;&#x6784;&#x5EFA;&#x3001;&#x8FD0;&#x884C;&#x3001;&#x6269;&#x5C55;&#x548C;&#x8DEF;&#x7531;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x662F;&#x7531;&#x7528;&#x6237;&#x81EA;&#x5DF1;&#x51B3;&#x5B9A;&#x7684;&#x3002;&#x8FD9;&#x4E9B;&#x662F; Knative &#x60F3;&#x8981;&#x8865;&#x5145;&#x7684;&#x7F3A;&#x5931;&#x90E8;&#x5206;&#x3002;</p>
<p>&#x4E5F;&#x8BB8;&#x60A8;&#x5DF2;&#x7ECF;&#x5728;&#x751F;&#x4EA7;&#x4E0A;&#x4F7F;&#x7528; Kubernetes&#xFF0C;&#x6216;&#x8005;&#x60A8;&#x662F;&#x4E00;&#x4E2A;&#x524D;&#x6CBF;&#x6280;&#x672F;&#x7231;&#x597D;&#x8005;&#xFF0C;&#x68A6;&#x60F3;&#x7740;&#x5C06;&#x60A8;&#x57FA;&#x4E8E; OS/2 &#x8FD0;&#x884C;&#x7684;&#x7EC4;&#x7EC7;&#x73B0;&#x4EE3;&#x5316;&#x3002;&#x4E0D;&#x7BA1;&#x600E;&#x6837;&#xFF0C;&#x672C;&#x62A5;&#x544A;&#x90FD;&#x6CA1;&#x6709;&#x5047;&#x5B9A;&#x592A;&#x591A;&#x4E1C;&#x897F;&#xFF0C;&#x53EA;&#x662F;&#x8981;&#x6C42;&#x60A8;&#x77E5;&#x9053;&#x5BB9;&#x5668;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x5177;&#x6709; Kubernetes &#x7684;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x77E5;&#x8BC6;&#xFF0C;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE; Kubernetes &#x96C6;&#x7FA4;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E9B;&#x60A8;&#x90FD;&#x4E0D;&#x5177;&#x5907;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48; Minikube &#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x9009;&#x62E9;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5C06;&#x4F7F;&#x7528;&#x5927;&#x91CF;&#x4EE3;&#x7801;&#x793A;&#x4F8B;&#x548C;&#x9884;&#x5148;&#x6784;&#x5EFA;&#x7684;&#x5BB9;&#x5668;&#x955C;&#x50CF;&#xFF0C;&#x8FD9;&#x4E9B;&#x955C;&#x50CF;&#x6211;&#x4EEC;&#x90FD;&#x4E3A;&#x8BFB;&#x8005;&#x5F00;&#x6E90;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x4ECE; <a href="http://github.com/gswk" target="_blank">http://github.com/gswk</a> &#x627E;&#x5230;&#x6240;&#x6709;&#x4EE3;&#x7801;&#x793A;&#x4F8B;&#xFF0C;&#x5E76;&#x5728; <a href="http://hub.docker.com/u/gswk" target="_blank">http://hub.docker.com/u/gswk</a> &#x627E;&#x5230;&#x6240;&#x6709;&#x5BB9;&#x5668;&#x955C;&#x50CF;&#x3002;&#x60A8;&#x8FD8;&#x53EF;&#x4EE5;&#x5728; <a href="http://gswkbook.com" target="_blank">http://gswkbook.com</a> &#x627E;&#x5230;&#x8FD9;&#x4E24;&#x4E2A;&#x5B58;&#x50A8;&#x5E93;&#x4EE5;&#x53CA;&#x5176;&#x4ED6;&#x91CD;&#x8981;&#x53C2;&#x8003;&#x8D44;&#x6599;&#x7684;&#x94FE;&#x63A5;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5BF9; Knative &#x7684;&#x672A;&#x6765;&#x5341;&#x5206;&#x671F;&#x5F85;&#x3002;&#x867D;&#x7136;&#x6211;&#x4EEC;&#x6765;&#x81EA; Pivotal&#x2014;&#x2014;Knative &#x6700;&#x5927;&#x7684;&#x8D21;&#x732E;&#x8005;&#x4E4B;&#x2014;&#x2014; &#x4F46;&#x672C;&#x62A5;&#x544A;&#x4EC5;&#x51FA;&#x81EA;&#x4E8E;&#x5BF9; Knative &#x7684;&#x53D1;&#x5C55;&#x524D;&#x666F;&#x5145;&#x6EE1;&#x671F;&#x5F85;&#x7684;&#x6211;&#x4EEC;&#x3002;&#x62A5;&#x544A;&#x4E2D;&#x5305;&#x542B;&#x4E86;&#x6211;&#x4EEC;&#x7684;&#x89C2;&#x70B9;&#xFF0C;&#x6709;&#x7684;&#x8BFB;&#x8005;&#x53EF;&#x80FD;&#x4E0D;&#x8BA4;&#x540C;&#x8FD9;&#x4E9B;&#x89C2;&#x70B9;&#xFF0C;&#x8FD8;&#x53EF;&#x80FD;&#x4F1A;&#x70ED;&#x60C5;&#x5730;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x9519;&#x4E86;&#x3002;&#x6CA1;&#x5173;&#x7CFB;&#xFF01;&#x8FD9;&#x4E2A;&#x9886;&#x57DF;&#x975E;&#x5E38;&#x65B0;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x65AD;&#x91CD;&#x65B0;&#x5B9A;&#x4E49;&#x81EA;&#x5DF1;&#x3002;&#x81F3;&#x5C11;&#xFF0C;&#x672C;&#x62A5;&#x544A;&#x5C06;&#x8BA9;&#x60A8;&#x601D;&#x8003;&#x65E0;&#x670D;&#x52A1;&#x5668;&#x67B6;&#x6784;&#xFF08;serverless&#xFF09;&#xFF0C;&#x60A8;&#x4F1A;&#x548C;&#x6211;&#x4EEC;&#x4E00;&#x6837;&#x5BF9; Knative &#x611F;&#x5230;&#x5174;&#x594B;&#x3002;</p>
<h2 id="&#x76EE;&#x6807;&#x8BFB;&#x8005;">&#x76EE;&#x6807;&#x8BFB;&#x8005;</h2>
<p>&#x6211;&#x4EEC;&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4EFD;&#x62A5;&#x544A;&#x4E3B;&#x8981;&#x662F;&#x9488;&#x5BF9;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7F16;&#x5199;&#x7684;&#x3002;&#x5728;&#x6574;&#x4E2A;&#x62A5;&#x544A;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x63A2;&#x7D22; serverless &#x67B6;&#x6784;&#x6A21;&#x5F0F;&#xFF0C;&#x5E76;&#x5411;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5C55;&#x793A;&#x81EA;&#x670D;&#x52A1;&#x7528;&#x4F8B;&#x793A;&#x4F8B;&#xFF08;&#x4F8B;&#x5982;&#x6784;&#x5EFA;&#x548C;&#x90E8;&#x7F72;&#x4EE3;&#x7801;&#xFF09;&#x3002;&#x7136;&#x800C;&#xFF0C;Knative &#x5438;&#x5F15;&#x4E86;&#x4E0D;&#x540C;&#x89D2;&#x8272;&#x7684;&#x6280;&#x672F;&#x4EBA;&#x5458;&#x3002;&#x7279;&#x522B;&#x662F;&#xFF0C;&#x5C06; Knative &#x7EC4;&#x4EF6;&#x4F5C;&#x4E3A;&#x66F4;&#x5927;&#x5E73;&#x53F0;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x6216;&#x4E0E;&#x4ED6;&#x4EEC;&#x7684;&#x7CFB;&#x7EDF;&#x96C6;&#x6210;&#x7684;&#x60F3;&#x6CD5;&#x4F1A;&#x5F15;&#x8D77;&#x8FD0;&#x7EF4;&#x548C;&#x5E73;&#x53F0;&#x6784;&#x5EFA;&#x8005;&#x4EEC;&#x7684;&#x6781;&#x5927;&#x5174;&#x8DA3;&#x3002;&#x5F53;&#x8FD9;&#x4E9B;&#x53D7;&#x4F17;&#x63A2;&#x7D22;&#x5982;&#x4F55;&#x4F7F;&#x7528; Knative &#x6765;&#x5B9E;&#x73B0;&#x5176;&#x7279;&#x5B9A;&#x76EE;&#x7684;&#x65F6;&#xFF0C;&#x672C;&#x62A5;&#x544A;&#x5C06;&#x5BF9;&#x4ED6;&#x4EEC;&#x975E;&#x5E38;&#x6709;&#x7528;&#x3002;</p>
<h2 id="&#x60A8;&#x5C06;&#x5B66;&#x5230;&#x4EC0;&#x4E48;">&#x60A8;&#x5C06;&#x5B66;&#x5230;&#x4EC0;&#x4E48;</h2>
<p>&#x5C3D;&#x7BA1;&#x672C;&#x62A5;&#x544A;&#x5E76;&#x4E0D;&#x65E8;&#x5728;&#x8BE6;&#x89E3; Knative &#x7684;&#x5168;&#x90E8;&#x529F;&#x80FD;&#xFF0C;&#x4F46;&#x5DF2;&#x8DB3;&#x591F;&#x6DF1;&#x5165;&#xFF0C;&#x53EF;&#x4EE5;&#x5E26;&#x60A8;&#x5165;&#x95E8; Knative&#xFF0C;&#x4E86;&#x89E3;&#x5B83;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x548C;&#x4F7F;&#x7528;&#x65B9;&#x5F0F;&#x3002;&#x521D;&#x6B65;&#x4E86;&#x89E3;&#x4E86; Knative &#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x82B1;&#x4E00;&#x4E9B;&#x65F6;&#x95F4;&#x7814;&#x7A76;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x5B83;&#x7684;&#x6BCF;&#x4E2A;&#x4E3B;&#x8981;&#x7EC4;&#x4EF6;&#x3002;&#x7136;&#x540E;&#x8F6C;&#x5230;&#x4E00;&#x4E9B;&#x9AD8;&#x7EA7;&#x7528;&#x4F8B;&#xFF0C;&#x6700;&#x540E;&#x901A;&#x8FC7;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x771F;&#x5B9E;&#x7684;&#x793A;&#x4F8B;&#x5E94;&#x7528;&#x6765;&#x7ED3;&#x675F;&#xFF0C;&#x8BE5;&#x5E94;&#x7528;&#x5C06;&#x5145;&#x5206;&#x5229;&#x7528;&#x60A8;&#x5728;&#x672C;&#x62A5;&#x544A;&#x4E2D;&#x5B66;&#x5230;&#x7684;&#x6240;&#x6709;&#x77E5;&#x8BC6;&#x3002;</p>
<h2 id="&#x81F4;&#x8C22;">&#x81F4;&#x8C22;</h2>
<p>&#x6211;&#x4EEC;&#x8981;&#x611F;&#x8C22; Pivotal&#x3002;&#x6211;&#x4EEC;&#x90FD;&#x662F;&#x7B2C;&#x4E00;&#x6B21;&#x5408;&#x4F5C;&#x5199;&#x4E66;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709; Pivotal &#x56E2;&#x961F;&#x7684;&#x652F;&#x6301;&#xFF0C;&#x53EF;&#x80FD;&#x5C31;&#x4E0D;&#x4F1A;&#x6709;&#x672C;&#x4E66;&#x3002;&#x6280;&#x672F;&#x8425;&#x9500;&#x603B;&#x76D1; Dan Baskette&#xFF08;&#x6211;&#x4EEC;&#x7684;&#x8001;&#x677F;&#xFF09;&#x548C;&#x4EA7;&#x54C1;&#x8425;&#x9500;&#x526F;&#x603B;&#x88C1; Richard Seroter &#x5728; Pivotal &#x548C;&#x9886;&#x5BFC;&#x8005;&#x7684;&#x6210;&#x957F;&#x4E2D;&#x53D1;&#x6325;&#x4E86;&#x91CD;&#x8981;&#x4F5C;&#x7528;&#x3002;&#x6211;&#x4EEC;&#x8981;&#x611F;&#x8C22; Jared Ruckle&#x3001;Derrick Harris &#x548C; Jeff Kelly&#xFF0C;&#x4ED6;&#x4EEC;&#x7ED9;&#x4E88;&#x6211;&#x4EEC;&#x5F88;&#x591A;&#x5E2E;&#x52A9;&#x3002;&#x6211;&#x4EEC;&#x8FD8;&#x8981;&#x611F;&#x8C22; Tevin Rawls&#xFF0C;&#x4ED6;&#x662F; Pivotal &#x56E2;&#x961F;&#x7684;&#x4E00;&#x540D;&#x4F18;&#x79C0;&#x5B9E;&#x4E60;&#x751F;&#xFF0C;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x5728;&#x7B2C; 7 &#x7AE0;&#x4E2D;&#x4E3A;&#x6211;&#x4EEC;&#x7684;&#x6F14;&#x793A;&#x6784;&#x5EFA;&#x4E86;&#x524D;&#x7AEF;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x611F;&#x8C22; O&#x2019;Reilly &#x56E2;&#x961F;&#x6240;&#x6709;&#x4EBA;&#x7684;&#x652F;&#x6301;&#x548C;&#x6307;&#x5BFC;&#x3002;&#x975E;&#x5E38;&#x611F;&#x8C22;&#x6574;&#x4E2A; Knative &#x793E;&#x533A;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x90A3;&#x4E9B;&#x5728; Pivotal &#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x7684;&#x4EBA;&#x3002;&#x6700;&#x540E;&#x6211;&#x4EEC;&#x8981;&#x611F;&#x8C22; Virginia Wilson&#x3001;Nic Williams &#x535A;&#x58EB;&#x3001;Mark Fisher&#x3001;Nate Schutta&#x3001;Michael Kehoe &#x548C; Andrew Martin &#x82B1;&#x65F6;&#x95F4;&#x5BA1;&#x9605;&#x6211;&#x4EEC;&#x7684;&#x7A3F;&#x4EF6;&#x3002;</p>
<p><em>Brian McClain</em>&#xFF1A;&#x6211;&#x8981;&#x611F;&#x8C22;&#x6211;&#x7684;&#x59BB;&#x5B50; Sarah &#x5728;&#x6211;&#x5199;&#x4F5C;&#x8FC7;&#x7A0B;&#x4E2D;&#x7ED9;&#x4E88;&#x6211;&#x4E0D;&#x65AD;&#x7684;&#x652F;&#x6301;&#x548C;&#x9F13;&#x52B1;&#x3002;&#x6211;&#x8FD8;&#x8981;&#x611F;&#x8C22;&#x6211;&#x4EEC;&#x7684;&#x4E24;&#x53EA;&#x72D7;&#xFF0C;Tony &#x548C; Brutus&#xFF0C;&#x8BA9;&#x6211;&#x51E0;&#x4E4E;&#x628A;&#x6240;&#x6709;&#x65F6;&#x95F4;&#x90FD;&#x7528;&#x5728;&#x8FD9;&#x4EFD;&#x62A5;&#x544A;&#x4E0A;&#x3002;&#x8FD8;&#x8981;&#x611F;&#x8C22;&#x6211;&#x4EEC;&#x7684;&#x4E09;&#x53EA;&#x732B; Tyson&#x3001;Marty &#x548C; Doc&#xFF0C;&#x5B83;&#x4EEC;&#x6709;&#x65F6;&#x5019;&#x4F1A;&#x8DB4;&#x5728;&#x6211;&#x7684;&#x7B14;&#x8BB0;&#x672C;&#x7535;&#x8111;&#x4E0A;&#x547C;&#x547C;&#x5927;&#x7761;&#xFF0C;&#x8FD9;&#x8BA9;&#x6211;&#x53EF;&#x4EE5;&#x66F4;&#x79EF;&#x6781;&#x5730;&#x6295;&#x5165;&#x5199;&#x4F5C;&#xFF0C;&#x611F;&#x8C22;&#x5B83;&#x4EEC;&#x7684;&#x966A;&#x4F34;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x611F;&#x8C22;&#x6211;&#x7684;&#x5408;&#x8457;&#x8005; Bryan Friedman&#xFF0C;&#x6CA1;&#x6709;&#x4ED6;&#xFF0C;&#x6211;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x5B8C;&#x6210;&#x8FD9;&#x4EFD;&#x62A5;&#x544A;&#x7684;&#x3002;Pivotal &#x544A;&#x8BC9;&#x6211;&#xFF0C;&#x5408;&#x4F5C;&#x662F; 1+1 &#x5927;&#x4E8E; 2&#x3002;</p>
<p><em>Bryan Friedman</em>&#xFF1A;&#x611F;&#x8C22;&#x6211;&#x7684;&#x59BB;&#x5B50; Alison&#xFF0C;&#x5979;&#x5341;&#x5206;&#x652F;&#x6301;&#x6211;&#x7684;&#x5199;&#x4F5C;&#xFF0C;&#x8FD8;&#x662F;&#x6211;&#x4EEC;&#x5BB6;&#x6700;&#x6709;&#x624D;&#x534E;&#x7684;&#x4F5C;&#x5BB6;&#x3002;&#x6211;&#x8FD8;&#x8981;&#x611F;&#x8C22;&#x6211;&#x4E24;&#x4E2A;&#x6F02;&#x4EAE;&#x7684;&#x5973;&#x513F;&#xFF0C;Madelyn &#x548C; Arielle&#xFF0C;&#x5979;&#x4EEC;&#x8BA9;&#x6211;&#x6BCF;&#x5929;&#x90FD;&#x53D8;&#x5F97;&#x66F4;&#x597D;&#x3002;&#x6211;&#x4E5F;&#x6709;&#x4E00;&#x4E2A;&#x5FE0;&#x8BDA;&#x7684;&#x529E;&#x516C;&#x5BA4;&#x4F19;&#x4F34;&#xFF0C;&#x6211;&#x7684;&#x72D7; Princeton&#xFF0C;&#x5B83;&#x5927;&#x591A;&#x53EA;&#x662F;&#x559C;&#x6B22;&#x5F85;&#x5728;&#x6C99;&#x53D1;&#x4E0A;&#xFF0C;&#x4F46;&#x5076;&#x5C14;&#x4F1A;&#x770B;&#x7740;&#x6211;&#x7684;&#x8138;&#xFF0C;&#x6697;&#x793A;&#x4ED6;&#x4E3A;&#x6211;&#x5728;&#x8FD9;&#x4EFD;&#x62A5;&#x544A;&#x4E0A;&#x7684;&#x5DE5;&#x4F5C;&#x611F;&#x5230;&#x81EA;&#x8C6A;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x6211;&#x65E0;&#x6CD5;&#x72EC;&#x81EA;&#x5B8C;&#x6210;&#x8FD9;&#x4E00;&#x5207;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x8981;&#x611F;&#x8C22;&#x6211;&#x7684;&#x5408;&#x8457;&#x8005; Brian McClain&#xFF0C;&#x4ED6;&#x7684;&#x6280;&#x672F;&#x5B9E;&#x529B;&#x548C;&#x5BCC;&#x6709;&#x611F;&#x67D3;&#x529B;&#x7684;&#x6FC0;&#x60C5;&#x5728;&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#x7ED9;&#x4E86;&#x6211;&#x6781;&#x5927;&#x7684;&#x5E2E;&#x52A9;&#x3002;&#x4E0E;&#x4ED6;&#x5408;&#x4F5C;&#x771F;&#x662F;&#x592A;&#x8363;&#x5E78;&#x4E86;&#x3002;</p>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; <a href="http://www.servicemesher.com" target="_blank">servicemesher.com</a> 2017-2019 all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification"> &#x6700;&#x540E;&#x66F4;&#x65B0;&#x4E8E; 
2019-05-13 14:43:49
</span></footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: 译者序">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="knative-overview.html" class="navigation navigation-next " aria-label="Next page: Knative 概述">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"owner":["rootsongjc"],"reviewer":["haiker2011","icyxp"],"description":"本章是全书的前言，用于说明本书的成因、划定目标读者、致谢等。","publishDate":"2019-03-03T00:00:00.000Z","updateDate":"2019-03-04T00:00:00.000Z","title":"前言","level":"1.2","depth":1,"next":{"title":"Knative 概述","level":"1.3","depth":1,"path":"knative-overview.md","ref":"knative-overview.md","articles":[]},"previous":{"title":"译者序","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"plugins":["github","codesnippet","splitter","-lunr","-search","search-plus","-sharing","theme-default","edit-link","page-toc-button","back-to-top-button","github-buttons@2.1.0","-highlight","prism","prism-themes","favicon@^0.0.2","tbfed-pagefooter@^0.0.1","3-ba","sitemap-general","ga"],"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright © <a href=http://www.servicemesher.com>servicemesher.com</a> 2017-2019","modify_label":" 最后更新于 ","modify_format":"YYYY-MM-DD HH:mm:ss"},"prism":{"css":["prism-themes/themes/prism-ghcolors.css"]},"github":{"url":"https://github.com/servicemesher/getting-started-with-knative"},"splitter":{},"codesnippet":{},"sitemap-general":{"prefix":"http://www.servicemesher.com/getting-started-with-knative/"},"fontsettings":{"theme":"white","family":"sans","size":2},"favicon":{"shortcut":"favicon.ico","bookmark":"favicon.ico"},"page-toc-button":{},"back-to-top-button":{},"prism-themes":{},"github-buttons":{"repo":"servicemesher/getting-started-with-knative","types":["star"],"size":"small"},"3-ba":{"configuration":"auto","token":"154337f0d95f0b110f98c1d5d7038895"},"ga":{"configuration":"auto","token":"UA-93485976-2"},"edit-link":{"label":"在线编辑","base":"https://github.com/servicemesher/getting-started-with-knative/edit/master"},"theme-default":{"showLevel":true,"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"}},"search-plus":{}},"theme":"default","author":"ServiceMesher","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Knative 入门中文版","language":"zh-hans","links":{"sidebar":{"ServiceMesher主页":"http://www.servicemesher.com"}},"gitbook":">=3.2.0","description":"Knative 入门中文版 by ServiceMesher 社区"},"file":{"path":"preface.md","mtime":"2019-05-13T06:43:49.402Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-06-27T06:20:19.791Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-plus/jquery.mark.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-plus/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-edit-link/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-3-ba/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

